Jiangyuejin/Note-about-learning/STM32/17-DMA数据转运/System/MyDMA.c
#include "stm32f10x.h"                  // Device header

uint16_t MyDMA_Size;                    //定义全局变量，用于记住Init函数的Size，共Transfer函数使用

/*
*   函   数；  DMA初始化
*   参   数：  AddrA原数组的首地址
*   参   数：  AddrB目的数组的首地址
*   参   数：  Size转运的数据大小（转运次数）
*   返回值：   无
*/

void MyDMA_Init(uint32_t AddrA, uint32_t AddrB, uint16_t Size)
{
    MyDMA_Size = Size;                  //将Size写入全局变量，记住参数Size
    /*开启时钟*/
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);              //开启DMA时钟
    
    /*DMA初始化*/
    DMA_InitTypeDef DMA_InitStructure;
    DMA_InitStructure.DMA_PeripheralBaseAddr = AddrA;                       //外设基地地址，给定形参AddrA
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte; //外设数据宽度，选择字节
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Enable;         //外设地址自增，选择使能
    DMA_InitStructure.DMA_MemoryBaseAddr = AddrB;                           //存储器基地地址，给定形参AddrB
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;         //存储器数据宽度，选择字节
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;                 //存储器地址自增，选择使能
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;                      //数据传输方向，选择从外设到存储器
    DMA_InitStructure.DMA_BufferSize = Size;                                //转运数据大小（转运次数）
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;                           //模式，选择正常模式
    DMA_InitStructure.DMA_M2M = DMA_M2M_Enable;                             //存储器到存储器，选择使能
    DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;                   //优先级，中等优先级
    DMA_Init(DMA1_Channel1, &DMA_InitStructure);
    
    /*DMA使能*/
    DMA_Cmd(DMA1_Channel1, DISABLE);            //我使用了使能，出问题啦,失能初始化后不会立刻工作，等调用transfer后再开始
}

/*
*   函   数：  启动DMA数据转运
*   参   数：  无
*   返回值：    无
*/
void MyDMA_Transfer(void)
{
    DMA_Cmd(DMA1_Channel1, DISABLE);                        //DMA失能，在写入传输计数器前，先让DMA暂停工作
    DMA_SetCurrDataCounter(DMA1_Channel1, MyDMA_Size);      //写入传输计数器，指定需要转运的次数
    DMA_Cmd(DMA1_Channel1, ENABLE);                         //DMA使能，开始工作
    
    while (DMA_GetFlagStatus(DMA1_FLAG_TC1)  == RESET);     //等待DMA工作完成
    DMA_ClearFlag(DMA1_FLAG_TC1);
}